---
kind: property
id: P:Autodesk.Revit.DB.SolidGeometryOptions.SolidTag
source: html/7957dff1-2d44-352f-47b1-d68d1f3bf15d.htm
---
# Autodesk.Revit.DB.SolidGeometryOptions.SolidTag Property

Optional solid tag for the Solid.

## Syntax (C#)
```csharp
public int SolidTag { get; set; }
```